export type tGroup = {
      "id": number, 
      "Группа": string | number,
      "Средняя цена": number ,
      "Максимальная цена": number ,
      "Минимальная цена": number,
  }[];




export const developers: tGroup = [
        {
            "id": 1,
            "Группа": "Choice of Games",
            "Средняя цена": 3.85,
            "Максимальная цена": 5.19,
            "Минимальная цена": 2.09
        },
        {
            "id": 2,
            "Группа": "KOEI TECMO GAMES CO., LTD.",
            "Средняя цена": 5.01,
            "Максимальная цена": 15.99,
            "Минимальная цена": 0.0
        },
        {
            "id": 3,
            "Группа": "Ripknot Systems",
            "Средняя цена": 8.69,
            "Максимальная цена": 20.99,
            "Минимальная цена": 4.99
        },
        {
            "id": 4,
            "Группа": "Laush Dmitriy Sergeevich",
            "Средняя цена": 1.81,
            "Максимальная цена": 4.79,
            "Минимальная цена": 0.79
        },
        {
            "id": 5,
            "Группа": "Nikita \"Ghost_RUS\"",
            "Средняя цена": 1.17,
            "Максимальная цена": 4.79,
            "Минимальная цена": 0.79
        },
        {
            "id": 6,
            "Группа": "Dexion Games",
            "Средняя цена": 0.88,
            "Максимальная цена": 2.09,
            "Минимальная цена": 0.79
        },
        {
            "id": 7,
            "Группа": "RewindApp",
            "Средняя цена": 0.95,
            "Максимальная цена": 3.99,
            "Минимальная цена": 0.79
        },
        {
            "id": 8,
            "Группа": "Hosted Games",
            "Средняя цена": 3.28,
            "Максимальная цена": 5.79,
            "Минимальная цена": 2.09
        },
        {
            "id": 9,
            "Группа": "Blender Games",
            "Средняя цена": 0.78,
            "Максимальная цена": 0.79,
            "Минимальная цена": 0.79
        },
        {
            "id": 10,
            "Группа": "Humongous Entertainment",
            "Средняя цена": 4.7,
            "Максимальная цена": 4.99,
            "Минимальная цена": 3.99
        },
        {
            "id": 11,
            "Группа": "For Kids",
            "Средняя цена": 1.56,
            "Максимальная цена": 7.19,
            "Минимальная цена": 0.0
        },
        {
            "id": 12,
            "Группа": "EnsenaSoft",
            "Средняя цена": 1.61,
            "Максимальная цена": 4.79,
            "Минимальная цена": 0.0
        },
        {
            "id": 13,
            "Группа": "Eipix Entertainment",
            "Средняя цена": 7.43,
            "Максимальная цена": 10.99,
            "Минимальная цена": 6.99
        },
        {
            "id": 14,
            "Группа": "Nekyau Games",
            "Средняя цена": 0.78,
            "Максимальная цена": 0.79,
            "Минимальная цена": 0.79
        },
        {
            "id": 15,
            "Группа": "Warfare Studios",
            "Средняя цена": 4.51,
            "Максимальная цена": 6.99,
            "Минимальная цена": 2.09
        },
        {
            "id": 16,
            "Группа": "HeR Interactive",
            "Средняя цена": 7.08,
            "Максимальная цена": 15.49,
            "Минимальная цена": 4.99
        },
        {
            "id": 17,
            "Группа": "MumboJumbo",
            "Средняя цена": 6.61,
            "Максимальная цена": 9.99,
            "Минимальная цена": 4.99
        },
        {
            "id": 18,
            "Группа": "ERS G Studios",
            "Средняя цена": 7.17,
            "Максимальная цена": 10.29,
            "Минимальная цена": 4.99
        },
        {
            "id": 19,
            "Группа": "Valve",
            "Средняя цена": 4.97,
            "Максимальная цена": 15.99,
            "Минимальная цена": 0.0
        },
        {
            "id": 20,
            "Группа": "Creobit",
            "Средняя цена": 3.7,
            "Максимальная цена": 3.99,
            "Минимальная цена": 0.0
        }
    ];

export const publishers: tGroup = [
    {
        "id": 1,
        "Группа": "Big Fish Games",
        "Средняя цена": 6.82,
        "Максимальная цена": 10.99,
        "Минимальная цена": 2.79
    },
    {
        "id": 2,
        "Группа": "Strategy First",
        "Средняя цена": 7.63,
        "Максимальная цена": 34.95,
        "Минимальная цена": 3.0
    },
    {
        "id": 3,
        "Группа": "Ubisoft",
        "Средняя цена": 16.48,
        "Максимальная цена": 49.99,
        "Минимальная цена": 3.0
    },
    {
        "id": 4,
        "Группа": "THQ Nordic",
        "Средняя цена": 12.85,
        "Максимальная цена": 44.99,
        "Минимальная цена": 3.0
    },
    {
        "id": 5,
        "Группа": "Square Enix",
        "Средняя цена": 12.19,
        "Максимальная цена": 44.99,
        "Минимальная цена": 4.0
    },
    {
        "id": 6,
        "Группа": "Sekai Project",
        "Средняя цена": 9.82,
        "Максимальная цена": 30.99,
        "Минимальная цена": 3.0
    },
    {
        "id": 7,
        "Группа": "Choice of Games",
        "Средняя цена": 3.85,
        "Максимальная цена": 5.19,
        "Минимальная цена": 2.09
    },
    {
        "id": 8,
        "Группа": "1C Entertainment",
        "Средняя цена": 6.19,
        "Максимальная цена": 27.79,
        "Минимальная цена": 2.0
    },
    {
        "id": 9,
        "Группа": "Dagestan Technology",
        "Средняя цена": 2.69,
        "Максимальная цена": 3.99,
        "Минимальная цена": 1.79
    },
    {
        "id": 10,
        "Группа": "SEGA",
        "Средняя цена": 13.31,
        "Максимальная цена": 49.99,
        "Минимальная цена": 4.11
    },
    {
        "id": 11,
        "Группа": "Degica",
        "Средняя цена": 12.47,
        "Максимальная цена": 60.99,
        "Минимальная цена": 1.59
    },
    {
        "id": 12,
        "Группа": "Plug In Digital",
        "Средняя цена": 6.38,
        "Максимальная цена": 29.99,
        "Минимальная цена": 4.2
    },
    {
        "id": 13,
        "Группа": "KOEI TECMO GAMES CO., LTD.",
        "Средняя цена": 27.92,
        "Максимальная цена": 54.99,
        "Минимальная цена": 4.3
    },
    {
        "id": 14,
        "Группа": "Slitherine Ltd.",
        "Средняя цена": 22.22,
        "Максимальная цена": 60.99,
        "Минимальная цена": 2.05
    },
    {
        "id": 15,
        "Группа": "KISS ltd",
        "Средняя цена": 5.77,
        "Максимальная цена": 22.99,
        "Минимальная цена": 1.05
    },
    {
        "id": 16,
        "Группа": "AGM PLAYISM",
        "Средняя цена": 5.89,
        "Максимальная цена": 19.49,
        "Минимальная цена": 1.02
    },
    {
        "id": 17,
        "Группа": "Artifex Mundi",
        "Средняя цена": 7.9,
        "Максимальная цена": 11.39,
        "Минимальная цена": 6.99
    },
    {
        "id": 18,
        "Группа": "Buka Entertainment",
        "Средняя цена": 4.79,
        "Максимальная цена": 14.99,
        "Минимальная цена": 1.79
    },
    {
        "id": 19,
        "Группа": "Devolver Digital",
        "Средняя цена": 9.65,
        "Максимальная цена": 34.99,
        "Минимальная цена": 1.0
    },
    {
        "id": 20,
        "Группа": "Atriagames",
        "Средняя цена": 2.11,
        "Максимальная цена": 7.19,
        "Минимальная цена": 0.79
    }
];